Revit 2027 API
ElectricalSystem.CircuitNamingIndex Property
 The Circuit Naming Index where the Electrical System is located in its panel. The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CircuitNamingIndex { get; }
Public ReadOnly Property CircuitNamingIndex As Integer
	Get
public:
property int CircuitNamingIndex {
	int get ();
}
member CircuitNamingIndex : int with get
Property Value
Int32
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace